OdFont.getLogFont(System.Void*)
\details
Returns the LOGFONT for this font
\param lpLogFont [in] Pointer to the buffer to receive the data.
\returns
Returns the number of bytes returned in buffer. In case lpLogFont is NULL methods return
number of bytes required in buffer.
\remarks
The default implementation of this function does nothing but return -1.

OdFont.getFileName
\details
Returns font file name.
\remarks
The default implementation of this function returns empty string.

OdFont.supportsVerticalMode
\details
Returns true if and only if the font supports vertical mode.
\remarks
The default implementation of this function returns false.

OdFont.getFontData(System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong,System.Void*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Returns the font data for the specified character.
\param dwTable [in]  Metric table to query.
\param dwOffset [in]  Offset into table.
\param pBuffer [in]  Pointer to to the buffer to receive the data.
\param cbData [in]  ???.
\returns
Returns the number of bytes returned in buffer.
\remarks
The default implementation of this function does nothing but return -1.

OdFont.getScore(System.UInt16,OdGePoint2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d*,OdGePoint3d*,OdTextProperties!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns arrays of points over and under the baseline for the specified character in this OdFont object.
\param character [in]  Character.
\param advance [in]  Offset to next character.
\param pointsOver [in]  Array of points over the baseline..
\param pointsUnder [in]  Array of points under the baseline.
\param textFlags [in] Text flags.
\remarks
textFlags must be a combination of one or more of the following:
Name                                Value
OdTextProperties::kNormalText       0x01
OdTextProperties::kVerticalText     0x02
OdTextProperties::kUnderlined       0x04
OdTextProperties::kOverlined        0x08
OdTextProperties::kLastChar         0x10
OdTextProperties::kInBigFont        0x20
OdTextProperties::kInclPenups       0x40
\remarks
The default implementation of this function does nothing but return.

OdFont.getAverageWidth
\details
Returns the average width of characters in this Font object.
\remarks
The default implementation of this function always returns 0.0.

OdFont.isShxFont
\details
Returns true if and only if this Font object is an SHX font.
\remarks
The default implementation of this function always returns true.

OdFont.getOverlinePos(System.Double)
\details
Returns the overline position for this Font object at the specified text size.
\param textSize [in]  Text size.
\remarks
The default implementation of this function returns 1.2 * textSize.

OdFont.getUnderlinePos(System.Double)
\details
Returns the underline position for this Font object at the specified text size.
\param textSize [in]  Text size.
\remarks
The default implementation of this function returns -2.0 * textSize.

OdFont.fontAbove
\details
Returns the height of this Font object above the baseline.
\remarks
The default implementation of this function returns getAbove(), unless it is 0.0, in which case this function returns 1.0.

OdFont.getInternalLeading
\details
Returns the internal leading of this Font object.
\remarks
The default implementation of this function always returns 0.

OdFont.getHeight
\details
Returns the height of this Font object.

OdFont.hasCharacter(System.UInt16)
\details
Returns true if and only if the specified character is defined in this Font object.
\param character [in]  Character.

OdFont.getAvailableChars(OdArray&lt;System.UInt16,OdMemoryAllocator&lt;System.UInt16&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns an array of the characters defined in this Font object.
\param characters [out]  Receives the array of characters.

OdFont.getBelow
\details
Returns the depth of this font object below the baseline.

OdFont.getAbove
\details
Returns the height of this Font object above the baseline.

OdFont.drawCharacter(System.UInt16,OdGePoint2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGiConveyorGeometry*,OdTextProperties*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Draws the specified character with this Font object.
\param character [in]  Character to draw.
\param advance [in]  Offset to next character.
\param pGeometry [in] Pointer to the modeler geometry.
\param textProperties [in] Text properties.

OdFont.drawCharacter(System.UInt16,OdGePoint2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGiCommonDraw*,OdTextProperties*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Draws the specified character with this Font object.
\param character [in]  Character to draw.
\param advance [in]  Offset to next character.
\param pWd [in/out] Draw object that can be used by this function to set the
necessary attributes and create the necessary geometry.
\param textProperties [in] Text properties.

OdFont.initialize(OdStreamBuf*)
\details
Initializes this Font object to read font data from the specified StreamBuf object.
\param pStreamBuf [in]  Pointer to the StreamBuf object from which the data are to be read.
\returns
Returns eOk if successful, or an appropriate error code if not.

OdFont.addFlag(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Adds the specified font flags to this Font object.
\param fontFlags [in]  Font flags.
\remarks
fontFlags must be a combination of zero or more of the following:
Name              Value
kBigFont10        0x0001
kUniFont10        0x0002
kFont10           0x0004
kFont11           0x0008
kFont10A          0x0010
kTrueType         0x0020
kFontGdt          0x0040
kFontSimplex6     0x0080
kShapes11         0x0100
kFontRsc          0x0200

OdFont.setFlags(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the font flags for this Font object.
\param fontFlags [in]  Font flags.
\remarks
fontFlags must be a combination of zero or more of the following:
Name              Value
kBigFont10        0x0001
kUniFont10        0x0002
kFont10           0x0004
kFont11           0x0008
kFont10A          0x0010
kTrueType         0x0020
kFontGdt          0x0040
kFontSimplex6     0x0080
kShapes11         0x0100
kFontRsc          0x0200

OdFont.flags
\details
Returns the font flags for this Font object.
\remarks
flags() returns a combination of zero or more of the following:
Name              Value
kBigFont10        0x0001
kUniFont10        0x0002
kFont10           0x0004
kFont11           0x0008
kFont10A          0x0010
kTrueType         0x0020
kFontGdt          0x0040
kFontSimplex6     0x0080
kShapes11         0x0100
kFontRsc          0x0200

OdFont.getFlags
\details
Returns the font flags for this Font object.
\remarks
getFlags() returns a combination of zero or more of the following:
Name              Value
kBigFont10        0x0001
kUniFont10        0x0002
kFont10           0x0004
kFont11           0x0008
kFont10A          0x0010
kTrueType         0x0020
kFontGdt          0x0040
kFontSimplex6     0x0080
kShapes11         0x0100
kFontRsc          0x0200